package main

import (
	"fmt"
	"strconv"
)



func main(){
	//Напишите программу, которая выводит на экран числа от 1 до 100.
	//
	//При этом:
	//- Вместо чисел, кратных трем, программа должна выводить строку “Fizz”.
	//- Вместо чисел, кратных пяти — строку “Buzz”.
	//- Вместо чисел, кратных и трем, и пяти — строку “FizzBuzz”.
	//
	//Задачу оформить в отдельном пулл-реквесте.

	for i:=1; i <=100; i++ {
		out := ""
		if i % 3 == 0 {
			out += "Fizz"
		}
		if i % 5 == 0 {
			out += "Buzz"
		}
		if out == "" {
			out = strconv.Itoa(i)
		}
		fmt.Println(out)
	}
}
